app/controllers/application_modules_controller.rb

SELECT "user_applications".* FROM "user_applications" WHERE (login = 'Public' AND application_type = 'application_module') ORDER BY name
SELECT "application_modules".* FROM "application_modules" WHERE "application_modules"."id" = 17 LIMIT 1
---
  def index

    respond_to do |format|
      format.html # index.html.erb
      format.xml  { render :xml => "" }
      format.json {

        nodes = Array.new

        if params[:node] == "root"
          application_modules = UserApplication.root_applications
          unless application_modules.nil?
            application_modules.each { |d|
              nodes.push( { :text => d.name, :id => d.id, :url => d.url, :home => d.home, :application_type => d.application_type, :xtype => d.application_module.xtype, :leaf => d.application_module.has_children? ? false : true, :cls => d.application_module.has_children? ? 'folder' : 'file' } )
            }
          end
        else
          node = ApplicationModule.find(params[:node])